Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/services_and_supports_for_children/children_in_care.html.txt.tmx
Source language: en
Languages: ga

source: Alternatively Tusla may apply to the court for a supervision order instead of a care order
ga: Nó, ina mhalairt dá chás, féadfaidh Tusla cur isteach ar ordú maoirseachta in áit ordú cúraim don chúirt

source: A supervision order gives Tusla the authority to visit and monitor the health and welfare of the child and to give the parents any necessary advice
ga: Tugann ordú maoirseachta údarás do Tusla le cuairt a thabhairt ar an leanbh agus le monatóireacht ar shláinte agus ar leas an linbh a dhéanamh agus le comhairle riachtanach a thabhairt do na tuismitheoirí

source: The order is for up to a maximum of 12 months but may be renewed
ga: Bíonn an t-ordú i bhfeidhm ar feadh suas le 12 mí ach gur féidir athnuachan a dhéanamh air

source: Tusla must apply for a special care order or an interim special care order where a child needs special care and protection and is unlikely to get it unless such an order is made
ga: Ní mór do Tusla cur isteach ar ordú cúraim speisialta nó ordú eatramhach cúraim speisialta i gcásanna ina bhfuil cúram agus cosaint de dhíth ag leanbh ach nár dhócha ar fáil gan a leithid d'ordú seo a dhéanamh

source: Tusla must convene a family welfare conference before applying for the order
ga: Ní mór do Tusla comhdháil um leas teaghlaigh a thionól roimh chur isteach ar an ordú

source: The court may make a special care order if it is satisfied that:
ga: Féadfaidh an chúirt ordú cúraim speisialta a dhéanamh nuair a bhíonn sí sásta:

source: • The child's behaviour poses a real and substantial risk to his/her health, safety, development or welfare and
ga: • go bhfuil iompraíocht an linbh baolach dá s(h)láinte, dá s(h)ábháilteacht, dá f(h)orbairt nó dá leas agus

source: • The child needs special care and protection which he/she is unlikely to get without such an order
ga: • go mbíonn cúram speisialta agus cosaint de dhíth ag an leanbh nár dhócha ar fáil gan a leithéid d’ordú cúraim

source: A special care order means that the child is committed to Tusla's care for as long as it remains in force
ga: Ciallaíonn ordú cúraim speisialta go bhfuil an leanbh tiomanta do chúram Tusla fad agus bhíonn sé i bhfeidhm

source: It authorises Tusla to provide appropriate care, education and treatment and, for that purpose, to detain the child in a special care unit
ga: Údaraíonn sé Tusla cúram, oideachas agus cóireáil oiriúnach a chur ar fáil agus, chuige sin, chun an leanbh a choinneáil in ionad cúraim speisialta

source: The order will initially be for a period between 3 and 6 months and may be extended
ga: Beidh an t-ordú i bhfeidhm ar feadh tréimhse idir 3 agus 6 mí agus féadfar é a shíniú

source: Special care orders may be varied by the court on its own initiative or by request of Tusla
ga: Is féidir leis an gcúirt orduithe cúraim a athrú ar a tionscnamh féin nó ar iarratas Tusla

source: The court may make a supervision or care order in respect of the child if appropriate
ga: Féadfaidh an chúirt ordú maoirseachta nó ordú cúraim a dhéanamh maidir leis an leanbh más oiriúnach

source: Interim special care orders may be made before the normal procedure for a special care order is complete
ga: Féadfar orduithe eatramhacha cúraim speisialta a dhéanamh roimh gnáthordú cúraim speisialta a chríochnú

source: Such orders will mean that the child may be detained in a special care unit for up to 28 days
ga: Ciallóidh a leithid d’orduithe seo gur féidir an leanbh a choinneáil in ionad cúraim speisialta go ceann suas go 28 lá
